xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPUTIMER</name>
      <description>CPU Timer Registers</description>
      <groupName>CPUTIMER</groupName>
      <baseAddress>0x00001800</baseAddress>
      <registers>
        <register>
          <name>TIMER0TIM</name>
          <description>CPU-Timer 0, Counter Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER0TIMH</name>
          <description>CPU-Timer 0, Counter Register High</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER0PRD</name>
          <description>CPU-Timer 0, Period Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER0PRDH</name>
          <description>CPU-Timer 0, Period Register High</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER0TCR</name>
          <description>CPU-Timer 0, Control Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER0TPR</name>
          <description>CPU-Timer 0, Prescale Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER0TPRH</name>
          <description>CPU-Timer 0, Prescale Register High</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER1TIM</name>
          <description>CPU-Timer 1, Counter Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER1TIMH</name>
          <description>CPU-Timer 1, Counter Register High</description>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER1PRD</name>
          <description>CPU-Timer 1, Period Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER1PRDH</name>
          <description>CPU-Timer 1, Period Register High</description>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER1TCR</name>
          <description>CPU-Timer 1, Control Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER1TPR</name>
          <description>CPU-Timer 1, Prescale Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER1TPRH</name>
          <description>CPU-Timer 1, Prescale Register High</description>
          <addressOffset>0x0000001E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER2TIM</name>
          <description>CPU-Timer 2, Counter Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER2TIMH</name>
          <description>CPU-Timer 2, Counter Register High</description>
          <addressOffset>0x00000022</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER2PRD</name>
          <description>CPU-Timer 2, Period Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER2PRDH</name>
          <description>CPU-Timer 2, Period Register High</description>
          <addressOffset>0x00000026</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER2TCR</name>
          <description>CPU-Timer 2, Control Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER2TPR</name>
          <description>CPU-Timer 2, Prescale Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TIMER2TPRH</name>
          <description>CPU-Timer 2, Prescale Register High</description>
          <addressOffset>0x0000002E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
