xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
        <register>
          <name>DMACH6_DST_BURST_STEP</name>
          <description>DMA Channel 6 Destination Burst Step Size Register</description>
          <addressOffset>0x0000018A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_TRANSFER_SIZE</name>
          <description>DMA Channel 6 Transfer Size Register</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_TRANSFER_COUNT</name>
          <description>DMA Channel 6 Transfer Count Register</description>
          <addressOffset>0x0000018E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_TRANSFER_STEP</name>
          <description>DMA Channel 6 Source Transfer Step Size Register</description>
          <addressOffset>0x00000190</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_TRANSFER_STEP</name>
          <description>DMA Channel 6 Destination Transfer Step Size Register</description>
          <addressOffset>0x00000192</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_WRAP_SIZE</name>
          <description>DMA Channel 6 Source Wrap Size Register</description>
          <addressOffset>0x00000194</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_WRAP_COUNT</name>
          <description>DMA Channel 6 Source Wrap Count Register</description>
          <addressOffset>0x00000196</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_WRAP_STEP</name>
          <description>DMA Channel 6 Source Wrap Step Size Register</description>
          <addressOffset>0x00000198</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_WRAP_SIZE</name>
          <description>DMA Channel 6 Destination Wrap Size Register</description>
          <addressOffset>0x0000019A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_WRAP_COUNT</name>
          <description>DMA Channel 6 Destination Wrap Count Register</description>
          <addressOffset>0x0000019C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_WRAP_STEP</name>
          <description>DMA Channel 6 Destination Wrap Step Size Register</description>
          <addressOffset>0x0000019E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 6 Shadow Source Begin Register</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_ADDR_SHADOW</name>
          <description>DMA Channel 6 Shadow Source Current Address Register</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 6 Active Source Begin Register</description>
          <addressOffset>0x000001A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_SRC_ADDR_ACTIVE</name>
          <description>DMA Channel 6 Active Source Current Address Register</description>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_BEG_ADDR_SHADOW</name>
          <description>DMA Channel 6 Shadow Destination Begin Register</description>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_ADDR_SHADOW</name>
          <description>DMA Channel 6 Shadow Destination Current Address Register</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_BEG_ADDR_ACTIVE</name>
          <description>DMA Channel 6 Active Destination Begin Register</description>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DMACH6_DST_ADDR_ACTIVE</name>
          <description>DMA Channel 6 Active Destination Current Address Register</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>RSVD1</name>
          <description>Reserved</description>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
