xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MCBSPA</name>
      <description>Multi-Channel Buffered Serial Port Registers</description>
      <groupName>MCBSPA</groupName>
      <baseAddress>0x0000A000</baseAddress>
      <registers>
        <register>
          <name>DRR2</name>
          <description>McBSP Data Receive Register 2</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DRR1</name>
          <description>McBSP Data Receive Register 1</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DXR2</name>
          <description>McBSP Data Transmit Register 2</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DXR1</name>
          <description>McBSP Data Transmit Register 1</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPCR2</name>
          <description>McBSP Serial Port Control Register 2</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPCR1</name>
          <description>McBSP Serial Port Control Register 1</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCR2</name>
          <description>McBSP Receive Control Register 2</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCR1</name>
          <description>McBSP Receive Control Register 1</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCR2</name>
          <description>McBSP Transmit Control Register 2</description>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCR1</name>
          <description>McBSP Transmit Control Register 1</description>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SRGR2</name>
          <description>McBSP Sample Rate Generator Register 2</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SRGR1</name>
          <description>McBSP Sample Rate Generator Register 1</description>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>MCR2</name>
          <description>McBSP Multichannel Register 2</description>
          <addressOffset>0x00000018</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>MCR1</name>
          <description>McBSP Multichannel Register 1</description>
          <addressOffset>0x0000001A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCERA</name>
          <description>McBSP Receive Channel Enable Register Partition A</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCERB</name>
          <description>McBSP Receive Channel Enable Register Partition B</description>
          <addressOffset>0x0000001E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCERA</name>
          <description>McBSP Transmit Channel Enable Register Partition A</description>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCERB</name>
          <description>McBSP Transmit Channel Enable Register Partition B</description>
          <addressOffset>0x00000022</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PCR</name>
          <description>McBSP Pin Control Register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCERC</name>
          <description>McBSP Receive Channel Enable Register Partition C</description>
          <addressOffset>0x00000026</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCERD</name>
          <description>McBSP Receive Channel Enable Register Partition D</description>
          <addressOffset>0x00000028</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCERC</name>
          <description>McBSP Transmit Channel Enable Register Partition C</description>
          <addressOffset>0x0000002A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCERD</name>
          <description>McBSP Transmit Channel Enable Register Partition D</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCERE</name>
          <description>McBSP Receive Channel Enable Register Partition E</description>
          <addressOffset>0x0000002E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCERF</name>
          <description>McBSP Receive Channel Enable Register Partition F</description>
          <addressOffset>0x00000030</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCERE</name>
          <description>McBSP Transmit Channel Enable Register Partition E</description>
          <addressOffset>0x00000032</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCERF</name>
          <description>McBSP Transmit Channel Enable Register Partition F</description>
          <addressOffset>0x00000034</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCERG</name>
          <description>McBSP Receive Channel Enable Register Partition G</description>
          <addressOffset>0x00000036</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>RCERH</name>
          <description>McBSP Receive Channel Enable Register Partition H</description>
          <addressOffset>0x00000038</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCERG</name>
          <description>McBSP Transmit Channel Enable Register Partition G</description>
          <addressOffset>0x0000003A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>XCERH</name>
          <description>McBSP Transmit Channel Enable Register Partition H</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>MFFINT</name>
          <description>McBSP Interrupt Enable Register</description>
          <addressOffset>0x00000046</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
