xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
        <register>
          <name>DCBLTRIPSEL</name>
          <description>Digital Compare BL Trip Select</description>
          <addressOffset>0x0000009E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ETINTPS</name>
          <description>Event-Trigger Interrupt Pre-Scale Register</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ETSOCPS</name>
          <description>Event-Trigger SOC Pre-Scale Register</description>
          <addressOffset>0x000000A2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ETCNTINITCTL</name>
          <description>Event-Trigger Counter Initialization Control Register</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ETCNTINIT</name>
          <description>Event-Trigger Counter Initialization Register</description>
          <addressOffset>0x000000A6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>EPWMXLINK</name>
          <description>EPWMx Link Register</description>
          <addressOffset>0x000000BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>TBPHSHRM</name>
          <description>Time Base Phase High Resolution Mirror Register</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TBPHSM</name>
          <description>Time Base Phase Mirror Register</description>
          <addressOffset>0x000000C2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TBPRDHRM2</name>
          <description>Time Base Period High Resolution Mirror 2 Register</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TBPRDM2</name>
          <description>Time Base Period Mirror 2 Register</description>
          <addressOffset>0x000000C6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CMPAHRM2</name>
          <description>Counter Compare A High Resolution Mirror 2 Register</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CMPAM2</name>
          <description>Counter Compare A Mirror 2 Register</description>
          <addressOffset>0x000000CA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CMPBHRM</name>
          <description>Counter Compare B Mirror High Resolution Register</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CMPBM</name>
          <description>Counter Compare B Mirror Register</description>
          <addressOffset>0x000000CE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CMPC</name>
          <description>Counter Compare C Register</description>
          <addressOffset>0x000000D2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CMPD</name>
          <description>Counter Compare D Register</description>
          <addressOffset>0x000000D6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DBREDHR</name>
          <description>Dead-Band Generator Rising Edge Delay High Resolution Mirror Register</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DBREDM</name>
          <description>Dead-Band Generator Rising Edge Delay Count Mirror Register</description>
          <addressOffset>0x000000DA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DBFEDHR</name>
          <description>Dead-Band Generator Falling Edge Delay High Resolution Register</description>
          <addressOffset>0x000000DC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DBFEDM</name>
          <description>Dead-Band Generator Falling Edge Delay Count Register</description>
          <addressOffset>0x000000DE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>ETCLRM</name>
          <description>Event Trigger Clear Register</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>TZCLRM</name>
          <description>Trip Zone Clear Register</description>
          <addressOffset>0x000000E2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>AQCTLAM</name>
          <description>Action Qualifier Control Register For Output A</description>
          <addressOffset>0x000000E6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>AQCTLBM</name>
          <description>Action Qualifier Control Register For Output B</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>AQSFRCM</name>
          <description>Action Qualifier Software Force Register</description>
          <addressOffset>0x000000EA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>AQCSFRCM</name>
          <description>Action Qualifier Continuous S/W Force Register</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
