xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOG1TRIP</name>
      <description>GPIOG1 TRIP REGS Registers</description>
      <groupName>GPIOG1TRIP</groupName>
      <baseAddress>0x0000BFC0</baseAddress>
      <registers>
        <register>
          <name>GPTRIP1SEL</name>
          <description>GPTRIP1 (TZ1n) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP2SEL</name>
          <description>GPTRIP2 (TZ2n) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP3SEL</name>
          <description>GPTRIP3 (TZ3n) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP4SEL</name>
          <description>GPTRIP4 (XINT1) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP5SEL</name>
          <description>GPTRIP5 (XINT2) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP6SEL</name>
          <description>GPTRIP6 (XINT3 and SYNCIN) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x0000000A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP7SEL</name>
          <description>GPTRIP7 (ECAP1) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP8SEL</name>
          <description>GPTRIP8 (ECAP2) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPIOLPMSEL1</name>
          <description>C28 LPM GPIO Select 1 Register (GPIO0 to 31)</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOLPMSEL2</name>
          <description>C28 LPM GPIO Select 2 Register (GPIO32 to 63)</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP9SEL</name>
          <description>GPTRIP9 (ECAP3) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP10SEL</name>
          <description>GPTRIP10 (ECAP4) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x00000022</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP11SEL</name>
          <description>GPTRIP11 (ECAP5) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x00000024</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>GPTRIP12SEL</name>
          <description>GPTRIP12 (ECAP6) Input Select Register (GPIO0 to 63)</description>
          <addressOffset>0x00000026</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x0000C800</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
