xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x0000C840</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP3</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x0000C880</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP4</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x0000C8C0</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP5</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x0000C900</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP6</name>
      <description>COMP REGS Registers</description>
      <groupName>COMP</groupName>
      <baseAddress>0x0000C940</baseAddress>
      <registers>
        <register>
          <name>COMPCTL</name>
          <description>Comparator Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>COMPSTS</name>
          <description>Compare Output States</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>DACVAL</name>
          <description>10-bit DAV Value</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
