xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCTRL</name>
      <description>SYS CTRL REGS Registers</description>
      <groupName>SYSCTRL</groupName>
      <baseAddress>0x0000E020</baseAddress>
      <registers>
        <register>
          <name>CLKCTL</name>
          <description>CPU Timer 2 Clock Configuration Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PCLKCR2</name>
          <description>Peripheral Clock Control Register2</description>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>HISPCP</name>
          <description>High Speed Clock Prescaler</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>LOSPCP</name>
          <description>Low Speed Clock Prescaler</description>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PCLKCR0</name>
          <description>Peripheral Clock Control Register0</description>
          <addressOffset>0x00000018</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PCLKCR1</name>
          <description>Peripheral Clock Control Register1</description>
          <addressOffset>0x0000001A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>LPMCR0</name>
          <description>C28 LPM Control Register0</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>PCLKCR3</name>
          <description>Peripheral Clock Control Register3</description>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>CWIR</name>
          <description>Control subsystem Wait-in-Reset Register</description>
          <addressOffset>0x00000036</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SPIA</name>
      <description>Serial Peripheral Interface Registers</description>
      <groupName>SPIA</groupName>
      <baseAddress>0x0000E080</baseAddress>
      <registers>
        <register>
          <name>SPICCR</name>
          <description>SPI Configuration Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPICTL</name>
          <description>SPI Operation Control Register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPISTS</name>
          <description>SPI Status Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPIBRR</name>
          <description>SPI Baud Rate Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPIRXEMU</name>
          <description>SPI Receive Emulation Buffer Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPIRXBUF</name>
          <description>SPI Serial Input Buffer Register</description>
          <addressOffset>0x0000000E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPITXBUF</name>
          <description>SPI Serial Output Buffer Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPIDAT</name>
          <description>SPI Serial Data Register</description>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPIFFTX</name>
          <description>SPI FIFO Transmit Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPIFFRX</name>
          <description>SPI FIFO Receive Register</description>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPIFFCT</name>
          <description>SPI FIFO Control Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <register>
          <name>SPIPRI</name>
          <description>SPI Priority Control Register</description>
          <addressOffset>0x0000001E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
