xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
        <register>
          <name>USB_DEVCTL</name>
          <description>USB Device Control</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_DEVCTL_SESSION</name>
              <description>Session Start/End</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_HOSTREQ</name>
              <description>Host Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_HOST</name>
              <description>Host Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_VBUS</name>
              <description>VBUS Level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_NONE</name>
                  <description>Below SessionEnd</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_SEND</name>
                  <description>Above SessionEnd, below AValid</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_AVALID</name>
                  <description>Above AValid, below VBUSValid</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_DEVCTL_VBUS_VALID</name>
                  <description>Above VBUSValid</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_DEVCTL_LSDEV</name>
              <description>Low-Speed Device Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_FSDEV</name>
              <description>Full-Speed Device Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVCTL_DEV</name>
              <description>Device Mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFIFOSZ</name>
          <description>USB Transmit Dynamic FIFO Sizing</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFIFOSZ</name>
          <description>USB Receive Dynamic FIFO Sizing</description>
          <addressOffset>0x000000C6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFIFOSZ_SIZE</name>
              <description>Max Packet Size</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_8</name>
                  <description>8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_16</name>
                  <description>16</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_32</name>
                  <description>32</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_64</name>
                  <description>64</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_128</name>
                  <description>128</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_256</name>
                  <description>256</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_512</name>
                  <description>512</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_1024</name>
                  <description>1024</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXFIFOSZ_SIZE_2048</name>
                  <description>2048</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXFIFOSZ_DPB</name>
              <description>Double Packet Buffer Support</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFIFOADD</name>
          <description>USB Transmit FIFO Start Address</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFIFOADD</name>
          <description>USB Receive FIFO Start Address</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFIFOADD_ADDR</name>
              <description>Transmit/Receive Start Address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_CONTIM</name>
          <description>USB Connect Timing</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_CONTIM_WTID</name>
              <description>Wait ID</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_CONTIM_WTCON</name>
              <description>Connect Wait</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_VPLEN</name>
          <description>USB OTG VBUS Pulse Timing</description>
          <addressOffset>0x000000F6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_VPLEN_VPLEN</name>
              <description>VBUS Pulse Length</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_FSEOF</name>
          <description>USB Full-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x000000FA</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_FSEOF_FSEOFG</name>
              <description>Full-Speed End-of-Frame Gap</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_LSEOF</name>
          <description>USB Low-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_LSEOF_LSEOFG</name>
              <description>Low-Speed End-of-Frame Gap</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR0</name>
          <description>USB Transmit Functional Address Endpoint 0</description>
          <addressOffset>0x00000100</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR0_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR0</name>
          <description>USB Transmit Hub Address Endpoint 0</description>
          <addressOffset>0x00000104</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR0_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR0_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT0</name>
          <description>USB Transmit Hub Port Endpoint 0</description>
          <addressOffset>0x00000106</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT0_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR1</name>
          <description>USB Transmit Functional Address Endpoint 1</description>
          <addressOffset>0x00000110</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR1_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR1</name>
          <description>USB Transmit Hub Address Endpoint 1</description>
          <addressOffset>0x00000114</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR1_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR1_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT1</name>
          <description>USB Transmit Hub Port Endpoint 1</description>
          <addressOffset>0x00000116</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR1</name>
          <description>USB Receive Functional Address Endpoint 1</description>
          <addressOffset>0x00000118</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR1_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR1</name>
          <description>USB Receive Hub Address Endpoint 1</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR1_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR1_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT1</name>
          <description>USB Receive Hub Port Endpoint 1</description>
          <addressOffset>0x0000011E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT1_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR2</name>
          <description>USB Transmit Functional Address Endpoint 2</description>
          <addressOffset>0x00000120</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR2</name>
          <description>USB Transmit Hub Address Endpoint 2</description>
          <addressOffset>0x00000124</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR2_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT2</name>
          <description>USB Transmit Hub Port Endpoint 2</description>
          <addressOffset>0x00000126</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR2</name>
          <description>USB Receive Functional Address Endpoint 2</description>
          <addressOffset>0x00000128</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR2_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR2</name>
          <description>USB Receive Hub Address Endpoint 2</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR2_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR2_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
