xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
        <register>
          <name>USB_RXHUBPORT2</name>
          <description>USB Receive Hub Port Endpoint 2</description>
          <addressOffset>0x0000012E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT2_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR3</name>
          <description>USB Transmit Functional Address Endpoint 3</description>
          <addressOffset>0x00000130</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR3_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR3</name>
          <description>USB Transmit Hub Address Endpoint 3</description>
          <addressOffset>0x00000134</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR3_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR3_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT3</name>
          <description>USB Transmit Hub Port Endpoint 3</description>
          <addressOffset>0x00000136</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT3_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR3</name>
          <description>USB Receive Functional Address Endpoint 3</description>
          <addressOffset>0x00000138</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR3_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR3</name>
          <description>USB Receive Hub Address Endpoint 3</description>
          <addressOffset>0x0000013C</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR3_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR3_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT3</name>
          <description>USB Receive Hub Port Endpoint 3</description>
          <addressOffset>0x0000013E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT3_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR4</name>
          <description>USB Transmit Functional Address Endpoint 4</description>
          <addressOffset>0x00000140</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR4_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR4</name>
          <description>USB Transmit Hub Address Endpoint 4</description>
          <addressOffset>0x00000144</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR4_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR4_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT4</name>
          <description>USB Transmit Hub Port Endpoint 4</description>
          <addressOffset>0x00000146</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT4_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR4</name>
          <description>USB Receive Functional Address Endpoint 4</description>
          <addressOffset>0x00000148</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR4_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR4</name>
          <description>USB Receive Hub Address Endpoint 4</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR4_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR4_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT4</name>
          <description>USB Receive Hub Port Endpoint 4</description>
          <addressOffset>0x0000014E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT4_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR5</name>
          <description>USB Transmit Functional Address Endpoint 5</description>
          <addressOffset>0x00000150</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR5_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR5</name>
          <description>USB Transmit Hub Address Endpoint 5</description>
          <addressOffset>0x00000154</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR5_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR5_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT5</name>
          <description>USB Transmit Hub Port Endpoint 5</description>
          <addressOffset>0x00000156</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT5_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR5</name>
          <description>USB Receive Functional Address Endpoint 5</description>
          <addressOffset>0x00000158</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR5_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR5</name>
          <description>USB Receive Hub Address Endpoint 5</description>
          <addressOffset>0x0000015C</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR5_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR5_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT5</name>
          <description>USB Receive Hub Port Endpoint 5</description>
          <addressOffset>0x0000015E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT5_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR6</name>
          <description>USB Transmit Functional Address Endpoint 6</description>
          <addressOffset>0x00000160</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR6_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR6</name>
          <description>USB Transmit Hub Address Endpoint 6</description>
          <addressOffset>0x00000164</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR6_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR6_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT6</name>
          <description>USB Transmit Hub Port Endpoint 6</description>
          <addressOffset>0x00000166</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT6_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR6</name>
          <description>USB Receive Functional Address Endpoint 6</description>
          <addressOffset>0x00000168</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR6_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR6</name>
          <description>USB Receive Hub Address Endpoint 6</description>
          <addressOffset>0x0000016C</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR6_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR6_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT6</name>
          <description>USB Receive Hub Port Endpoint 6</description>
          <addressOffset>0x0000016E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT6_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR7</name>
          <description>USB Transmit Functional Address Endpoint 7</description>
          <addressOffset>0x00000170</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR7_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR7</name>
          <description>USB Transmit Hub Address Endpoint 7</description>
          <addressOffset>0x00000174</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR7_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR7_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT7</name>
          <description>USB Transmit Hub Port Endpoint 7</description>
          <addressOffset>0x00000176</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT7_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR7</name>
          <description>USB Receive Functional Address Endpoint 7</description>
          <addressOffset>0x00000178</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR7_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR7</name>
          <description>USB Receive Hub Address Endpoint 7</description>
          <addressOffset>0x0000017C</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR7_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR7_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT7</name>
          <description>USB Receive Hub Port Endpoint 7</description>
          <addressOffset>0x0000017E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT7_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
