xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
        <register>
          <name>USB_TXFUNCADDR8</name>
          <description>USB Transmit Functional Address Endpoint 8</description>
          <addressOffset>0x00000180</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR8_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR8</name>
          <description>USB Transmit Hub Address Endpoint 8</description>
          <addressOffset>0x00000184</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR8_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR8_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT8</name>
          <description>USB Transmit Hub Port Endpoint 8</description>
          <addressOffset>0x00000186</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT8_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR8</name>
          <description>USB Receive Functional Address Endpoint 8</description>
          <addressOffset>0x00000188</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR8_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR8</name>
          <description>USB Receive Hub Address Endpoint 8</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR8_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR8_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT8</name>
          <description>USB Receive Hub Port Endpoint 8</description>
          <addressOffset>0x0000018E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT8_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR9</name>
          <description>USB Transmit Functional Address Endpoint 9</description>
          <addressOffset>0x00000190</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR9_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR9</name>
          <description>USB Transmit Hub Address Endpoint 9</description>
          <addressOffset>0x00000194</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR9_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR9_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT9</name>
          <description>USB Transmit Hub Port Endpoint 9</description>
          <addressOffset>0x00000196</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT9_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR9</name>
          <description>USB Receive Functional Address Endpoint 9</description>
          <addressOffset>0x00000198</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR9_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR9</name>
          <description>USB Receive Hub Address Endpoint 9</description>
          <addressOffset>0x0000019C</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR9_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR9_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT9</name>
          <description>USB Receive Hub Port Endpoint 9</description>
          <addressOffset>0x0000019E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT9_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR10</name>
          <description>USB Transmit Functional Address Endpoint 10</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR10_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR10</name>
          <description>USB Transmit Hub Address Endpoint 10</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR10_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR10_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT10</name>
          <description>USB Transmit Hub Port Endpoint 10</description>
          <addressOffset>0x000001A6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT10_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR10</name>
          <description>USB Receive Functional Address Endpoint 10</description>
          <addressOffset>0x000001A8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR10_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR10</name>
          <description>USB Receive Hub Address Endpoint 10</description>
          <addressOffset>0x000001AC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR10_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR10_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT10</name>
          <description>USB Receive Hub Port Endpoint 10</description>
          <addressOffset>0x000001AE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT10_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR11</name>
          <description>USB Transmit Functional Address Endpoint 11</description>
          <addressOffset>0x000001B0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR11_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR11</name>
          <description>USB Transmit Hub Address Endpoint 11</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR11_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR11_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT11</name>
          <description>USB Transmit Hub Port Endpoint 11</description>
          <addressOffset>0x000001B6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT11_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR11</name>
          <description>USB Receive Functional Address Endpoint 11</description>
          <addressOffset>0x000001B8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR11_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR11</name>
          <description>USB Receive Hub Address Endpoint 11</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR11_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR11_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT11</name>
          <description>USB Receive Hub Port Endpoint 11</description>
          <addressOffset>0x000001BE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT11_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR12</name>
          <description>USB Transmit Functional Address Endpoint 12</description>
          <addressOffset>0x000001C0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR12_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBADDR12</name>
          <description>USB Transmit Hub Address Endpoint 12</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBADDR12_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXHUBADDR12_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXHUBPORT12</name>
          <description>USB Transmit Hub Port Endpoint 12</description>
          <addressOffset>0x000001C6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXHUBPORT12_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXFUNCADDR12</name>
          <description>USB Receive Functional Address Endpoint 12</description>
          <addressOffset>0x000001C8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXFUNCADDR12_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBADDR12</name>
          <description>USB Receive Hub Address Endpoint 12</description>
          <addressOffset>0x000001CC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBADDR12_ADDR</name>
              <description>Hub Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXHUBADDR12_MULTTRAN</name>
              <description>Multiple Translators</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXHUBPORT12</name>
          <description>USB Receive Hub Port Endpoint 12</description>
          <addressOffset>0x000001CE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXHUBPORT12_PORT</name>
              <description>Hub Port</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXFUNCADDR13</name>
          <description>USB Transmit Functional Address Endpoint 13</description>
          <addressOffset>0x000001D0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXFUNCADDR13_ADDR</name>
              <description>Device Address</description>
              <bitOffset>6</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
