xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
        <register>
          <name>USB_TXTYPE5</name>
          <description>USB Host Transmit Configure Type Endpoint 5</description>
          <addressOffset>0x000002B4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXTYPE5_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE5_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE5_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE5_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE5_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE5_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXINTERVAL5</name>
          <description>USB Host Transmit Interval Endpoint 5</description>
          <addressOffset>0x000002B6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXINTERVAL5_TXPOLL</name>
              <description>TX Polling/NAK Limit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXTYPE5</name>
          <description>USB Host Configure Receive Type Endpoint 5</description>
          <addressOffset>0x000002B8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXTYPE5_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXTYPE5_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE5_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE5_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE5_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE5_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE5_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE5_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE5_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE5_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXINTERVAL5</name>
          <description>USB Host Receive Polling Interval Endpoint 5</description>
          <addressOffset>0x000002BA</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXINTERVAL5_TXPOLL</name>
              <description>RX Polling/NAK Limit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXMAXP6</name>
          <description>USB Maximum Transmit Data Endpoint 6</description>
          <addressOffset>0x000002C0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXMAXP6_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRL6</name>
          <description>USB Transmit Control and Status Endpoint 6 Low</description>
          <addressOffset>0x000002C4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXCSRL6_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL6_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL6_ERROR</name>
              <description>Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL6_UNDRN</name>
              <description>Underrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL6_FLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL6_SETUP</name>
              <description>Setup Packet</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL6_STALL</name>
              <description>Send STALL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL6_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL6_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL6_NAKTO</name>
              <description>NAK Timeout</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRH6</name>
          <description>USB Transmit Control and Status Endpoint 6 High</description>
          <addressOffset>0x000002C6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXCSRH6_DT</name>
              <description>Data Toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH6_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH6_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH6_FDT</name>
              <description>Force Data Toggle</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH6_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH6_MODE</name>
              <description>Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH6_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH6_AUTOSET</name>
              <description>Auto Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP6</name>
          <description>USB Maximum Receive Data Endpoint 6</description>
          <addressOffset>0x000002C8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXMAXP6_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRL6</name>
          <description>USB Receive Control and Status Endpoint 6 Low</description>
          <addressOffset>0x000002CC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCSRL6_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_FULL</name>
              <description>FIFO Full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_ERROR</name>
              <description>Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_OVER</name>
              <description>Overrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_DATAERR</name>
              <description>Data Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_NAKTO</name>
              <description>NAK Timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_FLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_REQPKT</name>
              <description>Request Packet</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_STALL</name>
              <description>Send STALL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL6_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRH6</name>
          <description>USB Receive Control and Status Endpoint 6 High</description>
          <addressOffset>0x000002CE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCSRH6_DT</name>
              <description>Data Toggle</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH6_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH6_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH6_DISNYET</name>
              <description>Disable NYET</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH6_PIDERR</name>
              <description>PID Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH6_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH6_AUTORQ</name>
              <description>Auto Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH6_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH6_AUTOCL</name>
              <description>Auto Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCOUNT6</name>
          <description>USB Receive Byte Count Endpoint 6</description>
          <addressOffset>0x000002D0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCOUNT6_COUNT</name>
              <description>Receive Packet Count</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXTYPE6</name>
          <description>USB Host Transmit Configure Type Endpoint 6</description>
          <addressOffset>0x000002D4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXTYPE6_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE6_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE6_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE6_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE6_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE6_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE6_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE6_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE6_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE6_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
