xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
        <register>
          <name>USB_RXCSRH12</name>
          <description>USB Receive Control and Status Endpoint 12 High</description>
          <addressOffset>0x0000038E</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCSRH12_DT</name>
              <description>Data Toggle</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH12_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH12_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH12_DISNYET</name>
              <description>Disable NYET</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH12_PIDERR</name>
              <description>PID Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH12_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH12_AUTORQ</name>
              <description>Auto Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH12_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH12_AUTOCL</name>
              <description>Auto Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCOUNT12</name>
          <description>USB Receive Byte Count Endpoint 12</description>
          <addressOffset>0x00000390</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCOUNT12_COUNT</name>
              <description>Receive Packet Count</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXTYPE12</name>
          <description>USB Host Transmit Configure Type Endpoint 12</description>
          <addressOffset>0x00000394</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXTYPE12_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE12_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE12_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE12_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE12_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE12_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXINTERVAL12</name>
          <description>USB Host Transmit Interval Endpoint 12</description>
          <addressOffset>0x00000396</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXINTERVAL12_TXPOLL</name>
              <description>TX Polling/NAK Limit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXTYPE12</name>
          <description>USB Host Configure Receive Type Endpoint 12</description>
          <addressOffset>0x00000398</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXTYPE12_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXTYPE12_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE12_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE12_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE12_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE12_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXINTERVAL12</name>
          <description>USB Host Receive Polling Interval Endpoint 12</description>
          <addressOffset>0x0000039A</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXINTERVAL12_TXPOLL</name>
              <description>RX Polling/NAK Limit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXMAXP13</name>
          <description>USB Maximum Transmit Data Endpoint 13</description>
          <addressOffset>0x000003A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXMAXP13_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRL13</name>
          <description>USB Transmit Control and Status Endpoint 13 Low</description>
          <addressOffset>0x000003A4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXCSRL13_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL13_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL13_ERROR</name>
              <description>Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL13_UNDRN</name>
              <description>Underrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL13_FLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL13_SETUP</name>
              <description>Setup Packet</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL13_STALL</name>
              <description>Send STALL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL13_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL13_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL13_NAKTO</name>
              <description>NAK Timeout</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRH13</name>
          <description>USB Transmit Control and Status Endpoint 13 High</description>
          <addressOffset>0x000003A6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXCSRH13_DT</name>
              <description>Data Toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH13_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH13_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH13_FDT</name>
              <description>Force Data Toggle</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH13_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH13_MODE</name>
              <description>Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH13_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH13_AUTOSET</name>
              <description>Auto Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP13</name>
          <description>USB Maximum Receive Data Endpoint 13</description>
          <addressOffset>0x000003A8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXMAXP13_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRL13</name>
          <description>USB Receive Control and Status Endpoint 13 Low</description>
          <addressOffset>0x000003AC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCSRL13_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_FULL</name>
              <description>FIFO Full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_ERROR</name>
              <description>Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_OVER</name>
              <description>Overrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_DATAERR</name>
              <description>Data Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_NAKTO</name>
              <description>NAK Timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_FLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_REQPKT</name>
              <description>Request Packet</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_STALL</name>
              <description>Send STALL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL13_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRH13</name>
          <description>USB Receive Control and Status Endpoint 13 High</description>
          <addressOffset>0x000003AE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCSRH13_DT</name>
              <description>Data Toggle</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH13_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH13_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH13_DISNYET</name>
              <description>Disable NYET</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH13_PIDERR</name>
              <description>PID Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH13_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH13_AUTORQ</name>
              <description>Auto Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH13_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH13_AUTOCL</name>
              <description>Auto Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
