xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
        <register>
          <name>USB_TXTYPE14</name>
          <description>USB Host Transmit Configure Type Endpoint 14</description>
          <addressOffset>0x000003D4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXTYPE14_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE14_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE14_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE14_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE14_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE14_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE14_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE14_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE14_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE14_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXINTERVAL14</name>
          <description>USB Host Transmit Interval Endpoint 14</description>
          <addressOffset>0x000003D6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXINTERVAL14_TXPOLL</name>
              <description>TX Polling/NAK Limit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXTYPE14</name>
          <description>USB Host Configure Receive Type Endpoint 14</description>
          <addressOffset>0x000003D8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXTYPE14_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXTYPE14_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE14_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE14_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE14_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE14_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE14_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE14_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE14_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE14_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXINTERVAL14</name>
          <description>USB Host Receive Polling Interval Endpoint 14</description>
          <addressOffset>0x000003DA</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXINTERVAL14_TXPOLL</name>
              <description>RX Polling/NAK Limit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXMAXP15</name>
          <description>USB Maximum Transmit Data Endpoint 15</description>
          <addressOffset>0x000003E0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXMAXP15_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRL15</name>
          <description>USB Transmit Control and Status Endpoint 15 Low</description>
          <addressOffset>0x000003E4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXCSRL15_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL15_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL15_ERROR</name>
              <description>Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL15_UNDRN</name>
              <description>Underrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL15_FLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL15_SETUP</name>
              <description>Setup Packet</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL15_STALL</name>
              <description>Send STALL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL15_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL15_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRL15_NAKTO</name>
              <description>NAK Timeout</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXCSRH15</name>
          <description>USB Transmit Control and Status Endpoint 15 High</description>
          <addressOffset>0x000003E6</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXCSRH15_DT</name>
              <description>Data Toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH15_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH15_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH15_FDT</name>
              <description>Force Data Toggle</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH15_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH15_MODE</name>
              <description>Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH15_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXCSRH15_AUTOSET</name>
              <description>Auto Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXMAXP15</name>
          <description>USB Maximum Receive Data Endpoint 15</description>
          <addressOffset>0x000003E8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXMAXP15_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRL15</name>
          <description>USB Receive Control and Status Endpoint 15 Low</description>
          <addressOffset>0x000003EC</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCSRL15_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_FULL</name>
              <description>FIFO Full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_ERROR</name>
              <description>Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_OVER</name>
              <description>Overrun</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_DATAERR</name>
              <description>Data Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_NAKTO</name>
              <description>NAK Timeout</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_FLUSH</name>
              <description>Flush FIFO</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_REQPKT</name>
              <description>Request Packet</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_STALL</name>
              <description>Send STALL</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRL15_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCSRH15</name>
          <description>USB Receive Control and Status Endpoint 15 High</description>
          <addressOffset>0x000003EE</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCSRH15_DT</name>
              <description>Data Toggle</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH15_DTWE</name>
              <description>Data Toggle Write Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH15_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH15_DISNYET</name>
              <description>Disable NYET</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH15_PIDERR</name>
              <description>PID Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH15_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH15_AUTORQ</name>
              <description>Auto Request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH15_ISO</name>
              <description>Isochronous Transfers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_RXCSRH15_AUTOCL</name>
              <description>Auto Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_RXCOUNT15</name>
          <description>USB Receive Byte Count Endpoint 15</description>
          <addressOffset>0x000003F0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>USB_RXCOUNT15_COUNT</name>
              <description>Receive Packet Count</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_TXTYPE15</name>
          <description>USB Host Transmit Configure Type Endpoint 15</description>
          <addressOffset>0x000003F4</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0x0000000000000000</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_TXTYPE15_TEP</name>
              <description>Target Endpoint Number</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_TXTYPE15_PROTO</name>
              <description>Protocol</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE15_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE15_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE15_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE15_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x30</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_TXTYPE15_SPEED</name>
              <description>Operating Speed</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_TXTYPE15_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE15_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_TXTYPE15_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0xC0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
