xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_PORTB_AHB</name>
      <description>GPIO REGS Registers</description>
      <groupName>GPIO_PORTB_AHB</groupName>
      <baseAddress>0x800B2000</baseAddress>
      <registers>
        <register>
          <name>GPIODATA</name>
          <description>GPIO Data</description>
          <addressOffset>0x000007F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIODIR</name>
          <description>GPIO Direction</description>
          <addressOffset>0x00000800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOIS</name>
          <description>GPIO Interrupt Sense</description>
          <addressOffset>0x00000808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOIBE</name>
          <description>GPIO Interrupt Both Edges</description>
          <addressOffset>0x00000810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOIEV</name>
          <description>GPIO Interrupt Event</description>
          <addressOffset>0x00000818</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOIM</name>
          <description>GPIO Interrupt Mask</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIORIS</name>
          <description>GPIO Raw Interrupt Status</description>
          <addressOffset>0x00000828</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOMIS</name>
          <description>GPIO Masked Interrupt Status</description>
          <addressOffset>0x00000830</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOICR</name>
          <description>GPIO Interrupt Clear</description>
          <addressOffset>0x00000838</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOAFSEL</name>
          <description>GPIO Alternate Function Select</description>
          <addressOffset>0x00000840</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOODR</name>
          <description>GPIO Open Drain Select</description>
          <addressOffset>0x00000A18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPUR</name>
          <description>GPIO Pull-Up Select</description>
          <addressOffset>0x00000A20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIODEN</name>
          <description>GPIO Digital Enable</description>
          <addressOffset>0x00000A38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOLOCK</name>
          <description>GPIO Lock</description>
          <addressOffset>0x00000A40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCR</name>
          <description>GPIO Commit</description>
          <addressOffset>0x00000A48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOAMSEL</name>
          <description>GPIO Analog Mode Select</description>
          <addressOffset>0x00000A50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPCTL</name>
          <description>GPIO Port Control</description>
          <addressOffset>0x00000A58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOAPSEL</name>
          <description>GPIO Alternate Port Select</description>
          <addressOffset>0x00000A60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCSEL</name>
          <description>GPIO Core Select</description>
          <addressOffset>0x00000A68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID4</name>
          <description>GPIO Peripheral Identification 4</description>
          <addressOffset>0x00001FA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID5</name>
          <description>GPIO Peripheral Identification 5</description>
          <addressOffset>0x00001FA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID6</name>
          <description>GPIO Peripheral Identification 6</description>
          <addressOffset>0x00001FB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID7</name>
          <description>GPIO Peripheral Identification 7</description>
          <addressOffset>0x00001FB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID0</name>
          <description>GPIO Peripheral Identification 0</description>
          <addressOffset>0x00001FC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID1</name>
          <description>GPIO Peripheral Identification 1</description>
          <addressOffset>0x00001FC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID2</name>
          <description>GPIO Peripheral Identification 2</description>
          <addressOffset>0x00001FD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOPERIPHID3</name>
          <description>GPIO Peripheral Identification 3</description>
          <addressOffset>0x00001FD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCELLID0</name>
          <description>GPIO PrimeCell Identification 0</description>
          <addressOffset>0x00001FE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCELLID1</name>
          <description>GPIO PrimeCell Identification 1</description>
          <addressOffset>0x00001FE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCELLID2</name>
          <description>GPIO PrimeCell Identification 2</description>
          <addressOffset>0x00001FF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>GPIOCELLID3</name>
          <description>GPIO PrimeCell Identification 3</description>
          <addressOffset>0x00001FF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
