xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RAM_CONFIG</name>
      <description>RAM CONFIG REGS Registers</description>
      <groupName>RAM_CONFIG</groupName>
      <baseAddress>0x801F6400</baseAddress>
      <registers>
        <register>
          <name>CXDRCR1</name>
          <description>Cx DEDRAM Config Register 1</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CXSRCR1</name>
          <description>Cx SHRAM Config Register 1</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MSXMSEL</name>
          <description>Sx SHRAM Master Select Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MSXSRCR1</name>
          <description>M3 Sx SHRAM Config Register 1</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MSXSRCR2</name>
          <description>M3 Sx SHRAM Config Register 2</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MTOCMSGRCR</name>
          <description>M3TOC28_MSG_RAM Config Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CXRTESTINIT1</name>
          <description>Cx RAM_TEST and INIT Register 1</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MSXRTESTINIT1</name>
          <description>M3 Sx RAM_TEST and INIT Register 1</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MTOCRTESTINIT</name>
          <description>M3 To Cx Message TEST and INIT Register</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>CXRINITDONE1</name>
          <description>Cx RAM_ INIT_DONE Register  1</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MSXRINITDONE1</name>
          <description>M3 Sx RAM_INIT_DONE Register</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MTOCRINITDONE</name>
          <description>M3 To Cx Message RAM Init Done</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RAM_ERROR</name>
      <description>RAM ERR REGS Registers</description>
      <groupName>RAM_ERROR</groupName>
      <baseAddress>0x801F6600</baseAddress>
      <registers>
        <register>
          <name>MCUNCWEADDR</name>
          <description>M3 CPU Uncorrectable Write Error Address Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MDUNCWEADDR</name>
          <description>M3 μDMA Uncorrectable Write Error Address Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MCUNCREADDR</name>
          <description>M3 CPU Uncorrectable Read Error Address Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MDUNCREADDR</name>
          <description>M3 μDMA Uncorrectable Read Error Address Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MCPUCREADDR</name>
          <description>M3 CPU Corrected Read Error Address Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MDMACREADDR</name>
          <description>M3 μDMA Corrected Read Error Address Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MUEFLG</name>
          <description>M3 Uncorrectable Error Flag Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MUEFRC</name>
          <description>M3 Uncorrectable Error Force Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MUECLR</name>
          <description>M3 Uncorrectable Error Flag Clear Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MCECNTR</name>
          <description>M3 Corrected Error Counter Register</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MCETRES</name>
          <description>M3 Corrected Error Threshold Register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MCEFLG</name>
          <description>M3 Corrected Error Threshold Exceeded Flag Register</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MCEFRC</name>
          <description>M3 Corrected Error Threshold Exceeded Force Register</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MCECLR</name>
          <description>M3 Corrected Error Threshold Exceeded Flag Clear Register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MCEIE</name>
          <description>M3 Single Error Interrupt Enable Register</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MNMAVFLG</name>
          <description>Non-Master Access Violation Flag Register</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MNMAVCLR</name>
          <description>Non-Master Access Violation Flag Clear Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MMAVFLG</name>
          <description>Master Access Violation Flag Register</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MMAVCLR</name>
          <description>Master Access Violation Flag Clear Register</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MNMWRAVADDR</name>
          <description>Non-Master CPU Write Access Violation Address Register</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MNMDMAWRAVADDR</name>
          <description>Non-Master DMA Write Access Violation Address Register</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MNMFAVADDR</name>
          <description>Non-Master CPU Fetch Access Violation Address Register</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MMWRAVADDR</name>
          <description>Master CPU Write Access Violation Address Register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MMDMAWRAVADDR</name>
          <description>Master DMA Write Access Violation Address Register</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>MMFAVADDR</name>
          <description>Master CPU Fetch Access Violation Address Register</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
