xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCSM</name>
      <description>DCSM REGS Registers</description>
      <groupName>DCSM</groupName>
      <baseAddress>0x801F6800</baseAddress>
      <registers>
        <register>
          <name>Z1_CSMKEY0</name>
          <description>CSMKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMKEY1</name>
          <description>CSMKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMKEY2</name>
          <description>CSMKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMKEY3</name>
          <description>CSMKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_ECSLKEY0</name>
          <description>ECSLKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_ECSLKEY1</name>
          <description>ECSLKEY Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMKEY0</name>
          <description>CSMKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMKEY1</name>
          <description>CSMKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMKEY2</name>
          <description>CSMKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMKEY3</name>
          <description>CSMKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_ECSLKEY0</name>
          <description>ECSLKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_ECSLKEY1</name>
          <description>ECSLKEY Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CSMLOCKSR</name>
          <description>Locked Status Register for CSM passwords of M3-Zone-1 security Zone</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_ECSLLOCKSR</name>
          <description>Locked Status Register for ECSL passwords of M3-Zone-1 security Zone</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CSMLOCKSR</name>
          <description>Locked Status Register for CSM passwords of M3-Zone-2 security Zone</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_ECSLLOCKSR</name>
          <description>Locked Status Register for ECSL passwords of M3-Zone-2 security Zone</description>
          <addressOffset>0x000000D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_CR</name>
          <description>Status and Control Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_CR</name>
          <description>Status and Control Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_GRABSECTR</name>
          <description>Grab Flash-Sectors Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_GRABRAMR</name>
          <description>Grab RAM-blocks Register for M3-Zone-1 security Zone</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_GRABSECTR</name>
          <description>Grab Flash-Sectors Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_GRABRAMR</name>
          <description>Grab RAM-blocks Register for M3-Zone-2 security Zone</description>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z1_EXEONLYR</name>
          <description>Execute-Only Select Register for flash sectors mapped to M3-Zone-1 security Zone</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>Z2_EXEONLYR</name>
          <description>Execute-Only Select Register for flash sectors mapped to M3-Zone-2 security Zone</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
