xsession/openocd/svd/ti/tms320f28m35x_c28x.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COREPERIPH</name>
      <description>M3 CORE PERIPHERALS Registers</description>
      <groupName>COREPERIPH</groupName>
      <baseAddress>0x1C001C000</baseAddress>
      <registers>
        <register>
          <name>NVIC_INT_TYPE</name>
          <description>Interrupt Controller Type Reg</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SYSTICK_ST_CTRL</name>
          <description>SysTick Control and Status Reg</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SYSTICK_ST_RELOAD</name>
          <description>SysTick Reload Value Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SYSTICK_ST_CURRENT</name>
          <description>SysTick Current Value Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SYSTICK_ST_CAL</name>
          <description>SysTick Calibration Value Reg</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN0</name>
          <description>IRQ 0 to 31 Set Enable Register</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN1</name>
          <description>IRQ 32 to 63 Set Enable Register</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN2</name>
          <description>IRQ 64 to 95 Set Enable Register</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN3</name>
          <description>IRQ 96 to 127 Set Enable Register</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_EN4</name>
          <description>IRQ 128 to 133 Set Enable Register</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS0</name>
          <description>IRQ 0 to 31 Clear Enable Reg</description>
          <addressOffset>0x00000300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS1</name>
          <description>IRQ 32 to 63 Clear Enable Reg</description>
          <addressOffset>0x00000308</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS2</name>
          <description>IRQ 64 to 95 Clear Enable Reg</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS3</name>
          <description>IRQ 96 to 127 Clear Enable Reg</description>
          <addressOffset>0x00000318</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_DIS4</name>
          <description>IRQ 128 to 133 Clear Enable Reg</description>
          <addressOffset>0x00000320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND0</name>
          <description>IRQ 0 to 31 Set Pending Register</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND1</name>
          <description>IRQ 32 to 63 Set Pending Reg</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND2</name>
          <description>IRQ 64 to 95 Set Pending Reg</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND3</name>
          <description>IRQ 96 to 127 Set Pending Reg</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PEND4</name>
          <description>IRQ 128 to 133 Set Pending Reg</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND0</name>
          <description>IRQ 0 to 31 Clear Pending Reg</description>
          <addressOffset>0x00000500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND1</name>
          <description>IRQ 32 to 63 Clear Pending Reg</description>
          <addressOffset>0x00000508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND2</name>
          <description>IRQ 64 to 95 Clear Pending Reg</description>
          <addressOffset>0x00000510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND3</name>
          <description>IRQ 96 to 127 Clear Pending Reg</description>
          <addressOffset>0x00000518</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_UNPEND4</name>
          <description>IRQ 128 to 133 Clear Pending Reg</description>
          <addressOffset>0x00000520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE0</name>
          <description>IRQ 0 to 31 Active Register</description>
          <addressOffset>0x00000600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE1</name>
          <description>IRQ 32 to 63 Active Register</description>
          <addressOffset>0x00000608</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE2</name>
          <description>IRQ 64 to 95 Active Register</description>
          <addressOffset>0x00000610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE3</name>
          <description>IRQ 96 to 127 Active Register</description>
          <addressOffset>0x00000618</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_ACTIVE4</name>
          <description>IRQ 128 to 133 Active Register</description>
          <addressOffset>0x00000620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI0</name>
          <description>IRQ 0 to 3 Priority Register</description>
          <addressOffset>0x00000800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI1</name>
          <description>IRQ 4 to 7 Priority Register</description>
          <addressOffset>0x00000808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI2</name>
          <description>IRQ 8 to 11 Priority Register</description>
          <addressOffset>0x00000810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI3</name>
          <description>IRQ 12 to 15 Priority Register</description>
          <addressOffset>0x00000818</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI4</name>
          <description>IRQ 16 to 19 Priority Register</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI5</name>
          <description>IRQ 20 to 23 Priority Register</description>
          <addressOffset>0x00000828</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI6</name>
          <description>IRQ 24 to 27 Priority Register</description>
          <addressOffset>0x00000830</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI7</name>
          <description>IRQ 28 to 31 Priority Register</description>
          <addressOffset>0x00000838</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI8</name>
          <description>IRQ 32 to 35 Priority Register</description>
          <addressOffset>0x00000840</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI9</name>
          <description>IRQ 36 to 39 Priority Register</description>
          <addressOffset>0x00000848</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI10</name>
          <description>IRQ 40 to 43 Priority Register</description>
          <addressOffset>0x00000850</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI11</name>
          <description>IRQ 44 to 47 Priority Register</description>
          <addressOffset>0x00000858</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI12</name>
          <description>IRQ 48 to 51 Priority Register</description>
          <addressOffset>0x00000860</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI13</name>
          <description>IRQ 52 to 55 Priority Register</description>
          <addressOffset>0x00000868</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI14</name>
          <description>IRQ 56 to 59 Priority Register</description>
          <addressOffset>0x00000870</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI15</name>
          <description>IRQ 60 to 63 Priority Register</description>
          <addressOffset>0x00000878</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI16</name>
          <description>IRQ 64 to 67 Priority Register</description>
          <addressOffset>0x00000880</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI17</name>
          <description>IRQ 68 to 71 Priority Register</description>
          <addressOffset>0x00000888</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI18</name>
          <description>IRQ 72 to 75 Priority Register</description>
          <addressOffset>0x00000890</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI19</name>
          <description>IRQ 76 to 79 Priority Register</description>
          <addressOffset>0x00000898</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI20</name>
          <description>IRQ 80 to 83 Priority Register</description>
          <addressOffset>0x000008A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI21</name>
          <description>IRQ 84 to 87 Priority Register</description>
          <addressOffset>0x000008A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI22</name>
          <description>IRQ 88 to 91 Priority Register</description>
          <addressOffset>0x000008B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI23</name>
          <description>IRQ 92 to 95 Priority Register</description>
          <addressOffset>0x000008B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI24</name>
          <description>IRQ 96 to 99 Priority Register</description>
          <addressOffset>0x000008C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI25</name>
          <description>IRQ 100 to 103 Priority Register</description>
          <addressOffset>0x000008C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI26</name>
          <description>IRQ 104 to 107 Priority Register</description>
          <addressOffset>0x000008D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI27</name>
          <description>IRQ 108 to 111 Priority Register</description>
          <addressOffset>0x000008D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI28</name>
          <description>IRQ 112 to 115 Priority Register</description>
          <addressOffset>0x000008E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI29</name>
          <description>IRQ 116 to 119 Priority Register</description>
          <addressOffset>0x000008E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI30</name>
          <description>IRQ 120 to 123 Priority Register</description>
          <addressOffset>0x000008F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI31</name>
          <description>IRQ 124 to 127 Priority Register</description>
          <addressOffset>0x000008F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI32</name>
          <description>IRQ 128 to 131 Priority Register</description>
          <addressOffset>0x00000900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>NVIC_PRI33</name>
          <description>IRQ 132 to 135 Priority Register</description>
          <addressOffset>0x00000908</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_CPUID</name>
          <description>CPUID Base Register</description>
          <addressOffset>0x00001A00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_INT_CTRL</name>
          <description>Interrupt Control State Register</description>
          <addressOffset>0x00001A08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_VTABLE</name>
          <description>Vector Table Offset Register</description>
          <addressOffset>0x00001A10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SCB_APINT</name>
          <description>App. Int &amp; Reset Control Reg</description>
          <addressOffset>0x00001A18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
